askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVRDA.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVRDA.bootloader.BOOTSIZE=0x01
AVRDA.bootloader.CODESIZE=0x00
AVRDA.bootloader.OSCCFG=0b00000000
AVRDA.bootloader.SYSCFG0=0b110{bootloader.updi_bit}{bootloader.reset_bit}0{bootloader.eesave_bit}
AVRDA.bootloader.SYSCFG1=0b0000{bootloader.mvsys_bit}000
AVRDA.bootloader.WDTCFG=0b00000000
AVRDA.bootloader.bod_lvl=000
AVRDA.bootloader.bod_mode=00
AVRDA.bootloader.bod_sample=0
AVRDA.bootloader.tool=avrdude
AVRDA.bootloader.eepupload=
AVRDA.bootloader.eesave_bit=1
AVRDA.bootloader.mvsys_bit=01
AVRDA.bootloader.reset_bit=10
AVRDA.bootloader.updi_bit=1
AVRDA.bootloader.programed_type=.with_bootloader
AVRDA.build.export_merged_output=true
AVRDA.build.text_section_start=.text=0x200
AVRDA.build.buildopt=-DNDEBUG
AVRDA.build.console_baud=-DCONSOLE_BAUD=9600
AVRDA.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVRDA.build.macroapi=-DENABLE_MACRO_API
AVRDA.build.printf=
AVRDA.build.printflt=
AVRDA.upload.protocol=arduino
AVRDA.upload.speed=115200
AVRDA.upload.tool=avrdude
AVRDA.menu.01_variant.01.build.board=AVR_AVR128DA64
AVRDA.menu.01_variant.01.build.mcu=avr128da64
AVRDA.menu.01_variant.01.build.variant=avr_da64
AVRDA.menu.01_variant.01.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega4.x
AVRDA.menu.01_variant.01.upload.maximum_data_size=16384
AVRDA.menu.01_variant.01.upload.maximum_size=130560
AVRDA.menu.01_variant.01=64pin AVR128DA64 (128KiB+16KiB)
AVRDA.menu.01_variant.02.build.board=AVR_AVR64DA64
AVRDA.menu.01_variant.02.build.mcu=avr64da64
AVRDA.menu.01_variant.02.build.variant=avr_da64
AVRDA.menu.01_variant.02.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2.x
AVRDA.menu.01_variant.02.upload.maximum_data_size=8192
AVRDA.menu.01_variant.02.upload.maximum_size=65024
AVRDA.menu.01_variant.02=64pin AVR64DA64 (64KiB+8KiB)
AVRDA.menu.01_variant.10=-
AVRDA.menu.01_variant.11.build.board=AVR_AVR128DA48
AVRDA.menu.01_variant.11.build.mcu=avr128da48
AVRDA.menu.01_variant.11.build.variant=avr_da48
AVRDA.menu.01_variant.11.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega4.x
AVRDA.menu.01_variant.11.upload.maximum_data_size=16384
AVRDA.menu.01_variant.11.upload.maximum_size=130560
AVRDA.menu.01_variant.11=48pin AVR128DA48 (128KiB+16KiB)
AVRDA.menu.01_variant.12.build.board=AVR_AVR64DA48
AVRDA.menu.01_variant.12.build.mcu=avr64da48
AVRDA.menu.01_variant.12.build.variant=avr_da48
AVRDA.menu.01_variant.12.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2.x
AVRDA.menu.01_variant.12.upload.maximum_data_size=8192
AVRDA.menu.01_variant.12.upload.maximum_size=65024
AVRDA.menu.01_variant.12=48pin AVR64DA48 (64KiB+8KiB)
AVRDA.menu.01_variant.13.build.board=AVR_AVR32DA48
AVRDA.menu.01_variant.13.build.mcu=avr32da48
AVRDA.menu.01_variant.13.build.variant=avr_da48
AVRDA.menu.01_variant.13.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3.x
AVRDA.menu.01_variant.13.upload.maximum_data_size=4096
AVRDA.menu.01_variant.13.upload.maximum_size=32256
AVRDA.menu.01_variant.13=48pin AVR32DA48 (32KiB+4KiB)
AVRDA.menu.01_variant.20=-
AVRDA.menu.01_variant.21.build.board=AVR_AVR128DA32
AVRDA.menu.01_variant.21.build.mcu=avr128da32
AVRDA.menu.01_variant.21.build.variant=avr_da32
AVRDA.menu.01_variant.21.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega4.x
AVRDA.menu.01_variant.21.upload.maximum_data_size=16384
AVRDA.menu.01_variant.21.upload.maximum_size=130560
AVRDA.menu.01_variant.21=32pin AVR128DA32 (128KiB+16KiB)
AVRDA.menu.01_variant.22.build.board=AVR_AVR64DA32
AVRDA.menu.01_variant.22.build.mcu=avr64da32
AVRDA.menu.01_variant.22.build.variant=avr_da32
AVRDA.menu.01_variant.22.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2.x
AVRDA.menu.01_variant.22.upload.maximum_data_size=8192
AVRDA.menu.01_variant.22.upload.maximum_size=65024
AVRDA.menu.01_variant.22=32pin AVR64DA32 (64KiB+8KiB)
AVRDA.menu.01_variant.23.build.board=AVR_AVR32DA32
AVRDA.menu.01_variant.23.build.mcu=avr32da32
AVRDA.menu.01_variant.23.build.variant=avr_da32
AVRDA.menu.01_variant.23.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3.x
AVRDA.menu.01_variant.23.upload.maximum_data_size=4096
AVRDA.menu.01_variant.23.upload.maximum_size=32256
AVRDA.menu.01_variant.23=32pin AVR32DA32 (32KiB+4KiB)
AVRDA.menu.01_variant.30=-
AVRDA.menu.01_variant.31.build.board=AVR_AVR128DA28
AVRDA.menu.01_variant.31.build.mcu=avr128da28
AVRDA.menu.01_variant.31.build.variant=avr_da28
AVRDA.menu.01_variant.31.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega4.x
AVRDA.menu.01_variant.31.upload.maximum_data_size=16384
AVRDA.menu.01_variant.31.upload.maximum_size=130560
AVRDA.menu.01_variant.31=28pin AVR128DA28 (128KiB+16KiB)
AVRDA.menu.01_variant.32.build.board=AVR_AVR64DA28
AVRDA.menu.01_variant.32.build.mcu=avr64da28
AVRDA.menu.01_variant.32.build.variant=avr_da28
AVRDA.menu.01_variant.32.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2.x
AVRDA.menu.01_variant.32.upload.maximum_data_size=8192
AVRDA.menu.01_variant.32.upload.maximum_size=65024
AVRDA.menu.01_variant.32=28pin AVR64DA28 (64KiB+8KiB)
AVRDA.menu.01_variant.33.build.board=AVR_AVR32DA28
AVRDA.menu.01_variant.33.build.mcu=avr32da28
AVRDA.menu.01_variant.33.build.variant=avr_da28
AVRDA.menu.01_variant.33.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega3.x
AVRDA.menu.01_variant.33.upload.maximum_data_size=4096
AVRDA.menu.01_variant.33.upload.maximum_size=32256
AVRDA.menu.01_variant.33=28pin AVR32DA28 (32KiB+4KiB)
AVRDA.menu.02_clock.01_24MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.01_24MHz.build.f_cpu=24000000L
AVRDA.menu.02_clock.01_24MHz=Internal 24 MHz (default)
AVRDA.menu.02_clock.01_12MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.01_12MHz.build.f_cpu=12000000L
AVRDA.menu.02_clock.01_12MHz=Internal 12 MHz
AVRDA.menu.02_clock.03_6MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.03_6MHz.build.f_cpu=6000000L
AVRDA.menu.02_clock.03_6MHz=Internal 6 MHz
AVRDA.menu.02_clock.04_3MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.04_3MHz.build.f_cpu=3000000L
AVRDA.menu.02_clock.04_3MHz=Internal 3 MHz
AVRDA.menu.02_clock.10=-
AVRDA.menu.02_clock.11_20MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.11_20MHz.build.f_cpu=20000000L
AVRDA.menu.02_clock.11_20MHz=Internal 20 MHz
AVRDA.menu.02_clock.12_10MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.12_10MHz.build.f_cpu=10000000L
AVRDA.menu.02_clock.12_10MHz=Internal 10 MHz
AVRDA.menu.02_clock.13_5MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.13_5MHz.build.f_cpu=5000000L
AVRDA.menu.02_clock.13_5MHz=Internal 5 MHz
AVRDA.menu.02_clock.20=-
AVRDA.menu.02_clock.21_16MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.21_16MHz.build.f_cpu=16000000L
AVRDA.menu.02_clock.21_16MHz=Internal 16 MHz
AVRDA.menu.02_clock.22_8MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.22_8MHz.build.f_cpu=8000000L
AVRDA.menu.02_clock.22_8MHz=Internal 8 MHz
AVRDA.menu.02_clock.23_4MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.23_4MHz.build.f_cpu=4000000L
AVRDA.menu.02_clock.23_4MHz=Internal 4 MHz
AVRDA.menu.02_clock.24_2MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.24_2MHz.build.f_cpu=2000000L
AVRDA.menu.02_clock.24_2MHz=Internal 2 MHz
AVRDA.menu.02_clock.25_1MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.25_1MHz.build.f_cpu=1000000L
AVRDA.menu.02_clock.25_1MHz=Internal 1 MHz
AVRDA.menu.02_clock.30=-
AVRDA.menu.02_clock.31_32MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.31_32MHz.build.f_cpu=32000000L
AVRDA.menu.02_clock.31_32MHz=Internal 32 MHz (OVERCLOCK)
AVRDA.menu.02_clock.32_28MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.32_28MHz.build.f_cpu=28000000L
AVRDA.menu.02_clock.32_28MHz=Internal 28 MHz (OVERCLOCK)
AVRDA.menu.02_clock.33_14MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.33_14MHz.build.f_cpu=14000000L
AVRDA.menu.02_clock.33_14MHz=Internal 14 MHz (OVERCLOCK)
AVRDA.menu.02_clock.34_7MHz.bootloader.bod_sample=0
AVRDA.menu.02_clock.34_7MHz.build.f_cpu=7000000L
AVRDA.menu.02_clock.34_7MHz=Internal 7 MHz (OVERCLOCK)
AVRDA.menu.02_clock.40=-
AVRDA.menu.02_clock.41_32768Hz.bootloader.bod_sample=1
AVRDA.menu.02_clock.41_32768Hz.build.f_cpu=32768
AVRDA.menu.02_clock.41_32768Hz=Internal 32.768 kHz (ULP)
AVRDA.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
AVRDA.menu.11_BODMODE.01_disabled=BOD Disabled
AVRDA.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
AVRDA.menu.11_BODMODE.02_enabled=BOD Enabled
AVRDA.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
AVRDA.menu.11_BODMODE.03_sampled=BOD Sampled
AVRDA.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
AVRDA.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
AVRDA.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
AVRDA.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
AVRDA.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
AVRDA.menu.12_BODLVL.BODLEVEL1=Level 2.45V
AVRDA.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
AVRDA.menu.12_BODLVL.BODLEVEL2=Level 2.7V
AVRDA.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
AVRDA.menu.12_BODLVL.BODLEVEL3=Level 2.85V
AVRDA.menu.21_resetpin.01_reset.bootloader.reset_bit=10
AVRDA.menu.21_resetpin.01_reset=PF6 pin=Reset
AVRDA.menu.21_resetpin.02_gpio.bootloader.reset_bit=00
AVRDA.menu.21_resetpin.02_gpio=PF6 pin=GPIO (input only)
AVRDA.menu.23_eeprom.01_keep.bootloader.eesave_bit=1
AVRDA.menu.23_eeprom.01_keep=Save guard "Retained"
AVRDA.menu.23_eeprom.02_erase.bootloader.eesave_bit=0
AVRDA.menu.23_eeprom.02_erase=Save guard "Erase"
AVRDA.menu.23_eeprom.03_replace.bootloader.eepupload={bootloader.eeprom}
AVRDA.menu.23_eeprom.03_replace.bootloader.eesave_bit=1
AVRDA.menu.23_eeprom.03_replace="Erase" and "Replace"
AVRDA.menu.51_buildopt.01_Release=Build Release (default)
AVRDA.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVRDA.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVRDA.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVRDA.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVRDA.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVRDA.menu.52_macroapi.02_Disable.build.macroapi=
AVRDA.menu.52_macroapi.02_Disable=Macro API Disable
AVRDA.menu.52_macroapi.03_AllDisable.build.macroapi=
AVRDA.menu.52_macroapi.03_AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVRDA.menu.52_macroapi.03_AllDisable=Standard Library All Disable
AVRDA.menu.53_printf.01_default=default
AVRDA.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVRDA.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVRDA.menu.53_printf.02_full=Float Support
AVRDA.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVRDA.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
AVRDA.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVRDA.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
AVRDA.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVRDA.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
AVRDA.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVRDA.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
AVRDA.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVRDA.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
AVRDA.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVRDA.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
AVRDA.menu.90_console_baud.20=-
AVRDA.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVRDA.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
AVRDA.menu.95_bootloader.01_UART0_A0_LA7.bootloader.file=hex/boot_avrdx_UART0_A0_{upload.speed}_LA7.hex
AVRDA.menu.95_bootloader.01_UART0_A0_LA7.build.console_select=-DSerial=Serial0A
AVRDA.menu.95_bootloader.01_UART0_A0_LA7=UART0 TX:PA0 RX:PA1 LED=PA7 (default)
AVRDA.menu.95_bootloader.10=-
AVRDA.menu.95_bootloader.01_UART2_F0_LA7.bootloader.file=hex/boot_avrdx_UART2_F0_{upload.speed}_LA7.hex
AVRDA.menu.95_bootloader.01_UART2_F0_LA7.build.console_select=-DSerial=Serial2A
AVRDA.menu.95_bootloader.01_UART2_F0_LA7=UART2 TX:PF0 RX:PF1 LED=PA7 (32/48/64pin)
AVRDA.menu.95_bootloader.23_UART2_F4_LA7.bootloader.file=hex/boot_avrdx_UART2_F4_{upload.speed}_LA7.hex
AVRDA.menu.95_bootloader.23_UART2_F4_LA7.build.console_select=-DSerial=Serial2B
AVRDA.menu.95_bootloader.23_UART2_F4_LA7=UART2 TX:PF4 RX:PF5 LED=PA7 (32/48/64pin)


