askn37/multix-zinnia-sdk-modernAVR/boards.txt
AVREA_noloader.bootloader.BODCFG=0b{bootloader.bod_lvl}{bootloader.bod_sample}{bootloader.bod_mode}00
AVREA_noloader.bootloader.BOOTSIZE=0x00
AVREA_noloader.bootloader.CODESIZE=0x00
AVREA_noloader.bootloader.OSCCFG=0b11110111
AVREA_noloader.bootloader.SYSCFG0=0b110{bootloader.updi_bit}{bootloader.reset_bit}1{bootloader.eesave_bit}
AVREA_noloader.bootloader.SYSCFG1=0b11111111
AVREA_noloader.bootloader.WDTCFG=0b00000000
AVREA_noloader.bootloader.bod_lvl=000
AVREA_noloader.bootloader.bod_mode=00
AVREA_noloader.bootloader.bod_sample=0
AVREA_noloader.bootloader.eepupload=
AVREA_noloader.bootloader.eesave_bit=1
AVREA_noloader.bootloader.reset_bit=10
AVREA_noloader.bootloader.tool=avrdude
AVREA_noloader.bootloader.updi_bit=1
AVREA_noloader.bootloader.file=empty/empty.hex
AVREA_noloader.bootloader.programed_type=
AVREA_noloader.build.console_select=
AVREA_noloader.build.export_merged_output=false
AVREA_noloader.build.text_section_start=.text=0x0
AVREA_noloader.build.buildopt=-DNDEBUG
AVREA_noloader.build.console_baud=-DCONSOLE_BAUD=9600
AVREA_noloader.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVREA_noloader.build.macroapi=-DENABLE_MACRO_API
AVREA_noloader.build.printf=
AVREA_noloader.build.printflt=
AVREA_noloader.upload.speed=115200
AVREA_noloader.upload.tool=
AVREA_noloader.menu.01_variant.12.build.board=AVR_AVR64EA48
AVREA_noloader.menu.01_variant.12.build.mcu=avr64ea48
AVREA_noloader.menu.01_variant.12.build.variant=avr_ea48
AVREA_noloader.menu.01_variant.12.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2.x
AVREA_noloader.menu.01_variant.12.upload.maximum_data_size=6144
AVREA_noloader.menu.01_variant.12.upload.maximum_size=65536
AVREA_noloader.menu.01_variant.12=48pin AVR64EA48 (64KiB+6KiB)
AVREA_noloader.menu.01_variant.20=-
AVREA_noloader.menu.01_variant.22.build.board=AVR_AVR64EA32
AVREA_noloader.menu.01_variant.22.build.mcu=avr64ea32
AVREA_noloader.menu.01_variant.22.build.variant=avr_ea32
AVREA_noloader.menu.01_variant.22.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2.x
AVREA_noloader.menu.01_variant.22.upload.maximum_data_size=6144
AVREA_noloader.menu.01_variant.22.upload.maximum_size=65536
AVREA_noloader.menu.01_variant.22=32pin AVR64EA32 (64KiB+6KiB)
AVREA_noloader.menu.01_variant.30=-
AVREA_noloader.menu.01_variant.32.build.board=AVR_AVR64EA28
AVREA_noloader.menu.01_variant.32.build.mcu=avr64ea28
AVREA_noloader.menu.01_variant.32.build.variant=avr_ea28
AVREA_noloader.menu.01_variant.32.compiler.c.elf.extra_flags=-Wl,-T{runtime.platform.path}/avrxmega2.x
AVREA_noloader.menu.01_variant.32.upload.maximum_data_size=6144
AVREA_noloader.menu.01_variant.32.upload.maximum_size=65536
AVREA_noloader.menu.01_variant.32=28pin AVR64EA28 (64KiB+6KiB)
AVREA_noloader.menu.03_clock.01_20MHz.bootloader.bod_sample=0
AVREA_noloader.menu.03_clock.01_20MHz.build.f_cpu=20000000L
AVREA_noloader.menu.03_clock.01_20MHz=Internal 20 MHz
AVREA_noloader.menu.03_clock.02_10MHz.bootloader.bod_sample=0
AVREA_noloader.menu.03_clock.02_10MHz.build.f_cpu=10000000L
AVREA_noloader.menu.03_clock.02_10MHz=Internal 10 MHz
AVREA_noloader.menu.03_clock.03_5MHz.bootloader.bod_sample=0
AVREA_noloader.menu.03_clock.03_5MHz.build.f_cpu=5000000L
AVREA_noloader.menu.03_clock.03_5MHz=Internal 5 MHz
AVREA_noloader.menu.03_clock.10=-
AVREA_noloader.menu.03_clock.11_16MHz.bootloader.OSCCFG=0b11111111
AVREA_noloader.menu.03_clock.11_16MHz.bootloader.bod_sample=0
AVREA_noloader.menu.03_clock.11_16MHz.build.f_cpu=16000000L
AVREA_noloader.menu.03_clock.11_16MHz=Internal 16 MHz
AVREA_noloader.menu.03_clock.12_8MHz.bootloader.OSCCFG=0b11111111
AVREA_noloader.menu.03_clock.12_8MHz.bootloader.bod_sample=0
AVREA_noloader.menu.03_clock.12_8MHz.build.f_cpu=8000000L
AVREA_noloader.menu.03_clock.12_8MHz=Internal 8 MHz
AVREA_noloader.menu.03_clock.13_4MHz.bootloader.OSCCFG=0b11111111
AVREA_noloader.menu.03_clock.13_4MHz.bootloader.bod_sample=0
AVREA_noloader.menu.03_clock.13_4MHz.build.f_cpu=4000000L
AVREA_noloader.menu.03_clock.13_4MHz=Internal 4 MHz
AVREA_noloader.menu.03_clock.15_1MHz.bootloader.OSCCFG=0b11111111
AVREA_noloader.menu.03_clock.15_1MHz.bootloader.bod_sample=0
AVREA_noloader.menu.03_clock.15_1MHz.build.f_cpu=1000000L
AVREA_noloader.menu.03_clock.15_1MHz=Internal 1 MHz
AVREA_noloader.menu.03_clock.20=-
AVREA_noloader.menu.03_clock.21_2MHz.bootloader.bod_sample=0
AVREA_noloader.menu.03_clock.21_2MHz.build.f_cpu=2000000L
AVREA_noloader.menu.03_clock.21_2MHz=Internal 2 MHz
AVREA_noloader.menu.03_clock.22_32768Hz.bootloader.bod_sample=1
AVREA_noloader.menu.03_clock.22_32768Hz.build.f_cpu=32768
AVREA_noloader.menu.03_clock.22_32768Hz=Internal 32.768 kHz (ULP)
AVREA_noloader.menu.11_BODMODE.01_disabled.bootloader.bod_mode=00
AVREA_noloader.menu.11_BODMODE.01_disabled=BOD Disabled
AVREA_noloader.menu.11_BODMODE.02_enabled.bootloader.bod_mode=01
AVREA_noloader.menu.11_BODMODE.02_enabled=BOD Enabled
AVREA_noloader.menu.11_BODMODE.03_sampled.bootloader.bod_mode=10
AVREA_noloader.menu.11_BODMODE.03_sampled=BOD Sampled
AVREA_noloader.menu.11_BODMODE.04_enablewait.bootloader.bod_mode=11
AVREA_noloader.menu.11_BODMODE.04_enablewait=BOD Enabled hold wakeup
AVREA_noloader.menu.12_BODLVL.BODLEVEL0.bootloader.bod_lvl=000
AVREA_noloader.menu.12_BODLVL.BODLEVEL0=Level 1.9V (default)
AVREA_noloader.menu.12_BODLVL.BODLEVEL1.bootloader.bod_lvl=001
AVREA_noloader.menu.12_BODLVL.BODLEVEL1=Level 2.45V
AVREA_noloader.menu.12_BODLVL.BODLEVEL2.bootloader.bod_lvl=010
AVREA_noloader.menu.12_BODLVL.BODLEVEL2=Level 2.7V
AVREA_noloader.menu.12_BODLVL.BODLEVEL3.bootloader.bod_lvl=011
AVREA_noloader.menu.12_BODLVL.BODLEVEL3=Level 2.85V
AVREA_noloader.menu.21_resetpin.01_reset.bootloader.reset_bit=11
AVREA_noloader.menu.21_resetpin.01_reset=PF6 pin=Reset
AVREA_noloader.menu.21_resetpin.02_gpio.bootloader.reset_bit=01
AVREA_noloader.menu.21_resetpin.02_gpio=PF6 pin=GPIO (input only)
AVREA_noloader.menu.22_updipin.01_updi.bootloader.updi_bit=1
AVREA_noloader.menu.22_updipin.01_updi=PF7 pin=UPDI (default)
AVREA_noloader.menu.22_updipin.02_gpio.bootloader.updi_bit=0
AVREA_noloader.menu.22_updipin.02_gpio=PF7 pin=GPIO (DANGER:NOT RECOMMENDED)
AVREA_noloader.menu.23_eeprom.01_keep.bootloader.eesave_bit=1
AVREA_noloader.menu.23_eeprom.01_keep=Save guard "Retained"
AVREA_noloader.menu.23_eeprom.02_erase.bootloader.eesave_bit=0
AVREA_noloader.menu.23_eeprom.02_erase=Save guard "Erase"
AVREA_noloader.menu.23_eeprom.03_replace.bootloader.eepupload={bootloader.eeprom}
AVREA_noloader.menu.23_eeprom.03_replace.bootloader.eesave_bit=1
AVREA_noloader.menu.23_eeprom.03_replace="Erase" and "Replace"
AVREA_noloader.menu.51_buildopt.01_Release=Build Release (default)
AVREA_noloader.menu.51_buildopt.02_Debug1.build.buildopt=-DDEBUG=1
AVREA_noloader.menu.51_buildopt.02_Debug1=Build DEBUG=1
AVREA_noloader.menu.51_buildopt.03_Debug2.build.buildopt=-DDEBUG=2
AVREA_noloader.menu.51_buildopt.03_Debug2=Build DEBUG=2
AVREA_noloader.menu.52_macroapi.01_Enable=Macro API Enable (default)
AVREA_noloader.menu.52_macroapi.02_Disable.build.macroapi=
AVREA_noloader.menu.52_macroapi.02_Disable=Macro API Disable
AVREA_noloader.menu.52_macroapi.03_AllDisable.build.macroapi=
AVREA_noloader.menu.52_macroapi.03_AllDisable.compiler.ldflags=-nostartfiles -nostdlib
AVREA_noloader.menu.52_macroapi.03_AllDisable=Standard Library All Disable
AVREA_noloader.menu.53_printf.01_default=default
AVREA_noloader.menu.53_printf.02_full.build.printf=-DUSE_PRINTF_FLT
AVREA_noloader.menu.53_printf.02_full.build.printflt=-Wl,-u,vfprintf -lprintf_flt
AVREA_noloader.menu.53_printf.02_full=Float Support
AVREA_noloader.menu.54_console_select.01.build.console_select=-DSerial=Serial0A
AVREA_noloader.menu.54_console_select.01.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVREA_noloader.menu.54_console_select.01=UART0 TX:PA0 RX:PA1 LED=PA7
AVREA_noloader.menu.54_console_select.02.build.console_select=-DSerial=Serial1A
AVREA_noloader.menu.54_console_select.02.build.led_pin=-DLED_BUILTIN=PIN_PA7
AVREA_noloader.menu.54_console_select.02=UART1 TX:PC0 RX:PC1 LED=PA7 (28/32pin)
AVREA_noloader.menu.54_console_select.10=-
AVREA_noloader.menu.54_console_select.11.build.console_select=-DSerial=Serial0A
AVREA_noloader.menu.54_console_select.11.build.led_pin=-DLED_BUILTIN=PIN_PD7
AVREA_noloader.menu.54_console_select.11=UART0 TX:PA0 RX:PA1 LED=PD7 (14/20pin)
AVREA_noloader.menu.90_console_baud.01_9600bps.build.console_baud=-DCONSOLE_BAUD=9600
AVREA_noloader.menu.90_console_baud.01_9600bps=CONSOLE_BAUD=9600 bps (default)
AVREA_noloader.menu.90_console_baud.03_38400bps.build.console_baud=-DCONSOLE_BAUD=38400
AVREA_noloader.menu.90_console_baud.03_38400bps=CONSOLE_BAUD=38400 bps
AVREA_noloader.menu.90_console_baud.04_57600bps.build.console_baud=-DCONSOLE_BAUD=57600
AVREA_noloader.menu.90_console_baud.04_57600bps=CONSOLE_BAUD=57600 bps
AVREA_noloader.menu.90_console_baud.05_115200bps.build.console_baud=-DCONSOLE_BAUD=115200
AVREA_noloader.menu.90_console_baud.05_115200bps=CONSOLE_BAUD=115200 bps
AVREA_noloader.menu.90_console_baud.06_230400bps.build.console_baud=-DCONSOLE_BAUD=230400
AVREA_noloader.menu.90_console_baud.06_230400bps=CONSOLE_BAUD=230400 bps
AVREA_noloader.menu.90_console_baud.15_1000000bps.build.console_baud=-DCONSOLE_BAUD=1000000
AVREA_noloader.menu.90_console_baud.15_1000000bps=CONSOLE_BAUD=1000000 bps
AVREA_noloader.menu.90_console_baud.20=-
AVREA_noloader.menu.90_console_baud.21_2400bps.build.console_baud=-DCONSOLE_BAUD=2400
AVREA_noloader.menu.90_console_baud.21_2400bps=CONSOLE_BAUD=2400 bps (for ULP)
AVREA_noloader.menu.95_bootloader.00_woBootloader=without Bootloader